Revit 2027 API
IFCData.AsDouble Method
 Gets storage value as double when its PrimitiveType is double.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AsDouble()
Public Function AsDouble As Double
public:
double AsDouble()
member AsDouble : unit -> float
Return Value
Double
 The double value.
Exceptions
Exception | Condition
InapplicableDataException |  The primitive type is not double.
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace